# Core
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "derailed/k9s"
tap "eugenmayer/dockersync"

# CLI tools
brew 'coreutils'
brew 'diff-so-fancy'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'gnu-sed'
brew 'hub'
brew 'neofetch'
brew 'shellcheck'
brew 'zsh'
brew 'wget'
brew 'certbot'
brew 'the_silver_searcher'
brew 'ripgrep'
brew 'asdf'
brew 'gpg2'
brew "skopeo"
brew 'git'
brew 'stow'
brew 'tree'
brew 'python'
brew 'neovim'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'
brew 'zsh-completion'
brew 'tmux'
brew 'pandoc'
brew 'openssl'
brew 'neofetch'
brew 'brightness'
brew 'awscli'
brew 'jq'
brew 'kubernetes-cli'
brew 'kubectx'
brew 'yq'
brew 'derailed/k9s/k9s'
brew 'eugenmayer/dockersync/unox'

# Casks
cask 'alfred'
cask 'docker'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'vlc'
cask 'visual-studio-code'
cask 'hammerspoon'
cask 'orbstack'
cask 'beekeeper-studio'
cask 'alacritty'
cask 'brave-browser'
cask 'google-cloud-sdk'

# Fonts
cask 'font-agave-nerd-font'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
